{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. use "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8B_PERIONDONTALDISEASE_OLINK_DEM\DATA\finaldata_unimputedfin",clear
{txt}
{com}. 
. capture mi set, clear
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8B_PERIONDONTALDISEASE_OLINK_DEM\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. ****************************************KAPLAN-MEIER SURVIVAL CURVES********************************************************************
. 
. **Total sample**
. 
. 
. set scheme sj
{txt}
{com}. 
. stset Age_dementia, failure(dem_diag==1) enter(AGE) id(n_eid) scale(1) 

{txt}Survival-time data settings

{col 12}ID variable: {res}n_eid
{col 10}{txt}Failure event: {res}dem_diag==1
{col 1}{txt}Observed time interval: {res}(Age_dementia[_n-1], Age_dementia]
{col 6}{txt}Enter on or after: {res}time AGE
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}     37,269{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}     37,269{txt}  observations remaining, representing
{res}     37,269{txt}  subjects
{res}        988{txt}  failures in single-failure-per-subject data
{res} 452,684.95{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res} 50.00137
                                          {txt}Last observed exit t = {res} 84.54757
{txt}
{com}. 
. 
. sts graph if sample_final==1 & _t<84, gwood legend(on) xlabel(65(5)90) ylabel(0.50(.10)1) xtitle("Age at diagnosis") ytitle("KM Estimated Proportion Dementia-Free (95%CI)") title("Poor oral health vs. dementia,total sample") by (poororalhealth_sev) tmin(65) tmax(90) 

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid
{txt}
{com}. graph save "FIGURE1A.gph", replace
{res}{txt}file {bf:FIGURE1A.gph} saved

{com}. sts test poororalhealth_sev if sample_final==1 & _t<84

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Equality of survivor functions
Log-rank test

{col 13} {c |}  Observed       Expected
poororalhe~v {c |}    events         events
{hline 13}{c +}{hline 25}
           0 {c |}{res}       642         698.15
           {txt}1 {c |}{res}       345         288.85
{txt}{hline 13}{c +}{hline 25}
       Total {c |}{res}       987         987.00

                       {txt}chi2(1) =  {res}15.66
                       {txt}Pr>chi2 = {res}0.0001
{txt}
{com}. stcox i.poororalhealth_sev if sample_final==1 & _t<84

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Iteration 0:  Log likelihood = {res}-9268.4273
{txt}Iteration 1:  Log likelihood = {res}-9260.8745
{txt}Iteration 2:  Log likelihood = {res} -9260.855
{txt}Refining estimates:
Iteration 0:  Log likelihood = {res} -9260.855

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 11:37,240}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:37,240}
{txt}No. of failures = {res}{ralign 11:987}
{txt}Time at risk    = {res}{ralign 11:452,272.711}
{col 57}{txt}{lalign 13:LR chi2({res:1})} = {res}{ralign 6:15.14}
{txt}Log likelihood = {res}-9260.855{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0001}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  _t{col 22}{c |} Haz. ratio{col 34}   Std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.poororalhealth_sev {c |}{col 22}{res}{space 2}  1.30428{col 34}{space 2} .0878016{col 45}{space 1}    3.95{col 54}{space 3}0.000{col 62}{space 4} 1.143062{col 75}{space 3} 1.488237
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. sts graph if sample_final==1 & _t<84, gwood legend(on) xlabel(65(5)90) ylabel(0.50(.10)1) xtitle("Age at diagnosis") ytitle("KM Estimated Proportion Dementia-Free (95%CI)") title("Poor oral health vs. dementia,total sample") by (poororalhealth_sev) tmin(65) tmax(90) risktable

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid
{txt}
{com}. 
. 
. **Men**
. 
. set scheme sj
{txt}
{com}. 
. stset Age_dementia, failure(dem_diag==1) enter(AGE) id(n_eid) scale(1) 

{txt}Survival-time data settings

{col 12}ID variable: {res}n_eid
{col 10}{txt}Failure event: {res}dem_diag==1
{col 1}{txt}Observed time interval: {res}(Age_dementia[_n-1], Age_dementia]
{col 6}{txt}Enter on or after: {res}time AGE
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}     37,269{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}     37,269{txt}  observations remaining, representing
{res}     37,269{txt}  subjects
{res}        988{txt}  failures in single-failure-per-subject data
{res} 452,684.95{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res} 50.00137
                                          {txt}Last observed exit t = {res} 84.54757
{txt}
{com}. 
. 
. sts graph if sample_final==1 & _t<84 & SEX==1, gwood legend(on) xlabel(65(5)90) ylabel(0.50(.10)1) xtitle("Age at diagnosis") ytitle("KM Estimated Proportion Dementia-Free (95%CI)") title("Poor oral health vs. dementia, Men") by (poororalhealth_sev) tmin(65) tmax(90) 

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid
{txt}
{com}. graph save "FIGURE1B.gph", replace
{res}{txt}file {bf:FIGURE1B.gph} saved

{com}. sts test poororalhealth_sev if sample_final==1 & _t<84 & SEX==1

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Equality of survivor functions
Log-rank test

{col 13} {c |}  Observed       Expected
poororalhe~v {c |}    events         events
{hline 13}{c +}{hline 25}
           0 {c |}{res}       359         378.23
           {txt}1 {c |}{res}       180         160.77
{txt}{hline 13}{c +}{hline 25}
       Total {c |}{res}       539         539.00

                       {txt}chi2(1) =   {res}3.32
                       {txt}Pr>chi2 = {res}0.0685
{txt}
{com}. stcox i.poororalhealth_sev if sample_final==1 & _t<84 & SEX==1

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Iteration 0:  Log likelihood = {res}-4667.9978
{txt}Iteration 1:  Log likelihood = {res}-4666.3745
{txt}Iteration 2:  Log likelihood = {res}-4666.3728
{txt}Refining estimates:
Iteration 0:  Log likelihood = {res}-4666.3728

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 11:17,466}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:17,466}
{txt}No. of failures = {res}{ralign 11:539}
{txt}Time at risk    = {res}{ralign 11:208,815.401}
{col 57}{txt}{lalign 13:LR chi2({res:1})} = {res}{ralign 6:3.25}
{txt}Log likelihood = {res}-4666.3728{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0714}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  _t{col 22}{c |} Haz. ratio{col 34}   Std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.poororalhealth_sev {c |}{col 22}{res}{space 2}   1.1822{col 34}{space 2} .1087344{col 45}{space 1}    1.82{col 54}{space 3}0.069{col 62}{space 4} .9871901{col 75}{space 3} 1.415733
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. 
. **Women**
. 
. set scheme sj
{txt}
{com}. 
. stset Age_dementia, failure(dem_diag==1) enter(AGE) id(n_eid) scale(1) 

{txt}Survival-time data settings

{col 12}ID variable: {res}n_eid
{col 10}{txt}Failure event: {res}dem_diag==1
{col 1}{txt}Observed time interval: {res}(Age_dementia[_n-1], Age_dementia]
{col 6}{txt}Enter on or after: {res}time AGE
{col 6}{txt}Exit on or before: {res}failure

{txt}{hline 74}
{res}     37,269{txt}  total observations
{res}          0{txt}  exclusions
{hline 74}
{res}     37,269{txt}  observations remaining, representing
{res}     37,269{txt}  subjects
{res}        988{txt}  failures in single-failure-per-subject data
{res} 452,684.95{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res} 50.00137
                                          {txt}Last observed exit t = {res} 84.54757
{txt}
{com}. 
. 
. sts graph if sample_final==1 & _t<84 & SEX==2, gwood legend(on) xlabel(65(5)90) ylabel(0.50(.10)1) xtitle("Age at diagnosis") ytitle("KM Estimated Proportion Dementia-Free (95%CI)") title("Poor oral health vs. dementia, Women") by (poororalhealth_sev) tmin(65) tmax(90) 

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid
{txt}
{com}. graph save "FIGURE1C.gph", replace
{res}{txt}file {bf:FIGURE1C.gph} saved

{com}. sts test poororalhealth_sev if sample_final==1 & _t<84 & SEX==2

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Equality of survivor functions
Log-rank test

{col 13} {c |}  Observed       Expected
poororalhe~v {c |}    events         events
{hline 13}{c +}{hline 25}
           0 {c |}{res}       283         319.29
           {txt}1 {c |}{res}       165         128.71
{txt}{hline 13}{c +}{hline 25}
       Total {c |}{res}       448         448.00

                       {txt}chi2(1) =  {res}14.60
                       {txt}Pr>chi2 = {res}0.0001
{txt}
{com}. stcox i.poororalhealth_sev if sample_final==1 & _t<84 & SEX==2

{col 10}{txt}Failure {bf:_d}: {res}dem_diag==1
{col 4}{txt}Analysis time {bf:_t}: {res}Age_dementia
{col 3}{txt}Enter on or after: {res}time AGE
{col 9}{txt}ID variable: {res}n_eid

{txt}Iteration 0:  Log likelihood = {res}-3912.3687
{txt}Iteration 1:  Log likelihood = {res}-3905.4429
{txt}Iteration 2:  Log likelihood = {res}-3905.4073
{txt}Iteration 3:  Log likelihood = {res}-3905.4073
{txt}Refining estimates:
Iteration 0:  Log likelihood = {res}-3905.4073

{txt}Cox regression with Breslow method for ties

No. of subjects = {res}{ralign 10:19,774}{col 57}{txt}{lalign 13:Number of obs} = {res}{ralign 6:19,774}
{txt}No. of failures = {res}{ralign 10:448}
{txt}Time at risk    = {res}{ralign 10:243,457.31}
{col 57}{txt}{lalign 13:LR chi2({res:1})} = {res}{ralign 6:13.92}
{txt}Log likelihood = {res}-3905.4073{col 57}{txt}{lalign 13:Prob > chi2} = {res}{ralign 6:0.0002}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}                  _t{col 22}{c |} Haz. ratio{col 34}   Std. err.{col 46}      z{col 54}   P>|z|{col 62}     [95% con{col 75}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
1.poororalhealth_sev {c |}{col 22}{res}{space 2} 1.456252{col 34}{space 2} .1440691{col 45}{space 1}    3.80{col 54}{space 3}0.000{col 62}{space 4} 1.199571{col 75}{space 3} 1.767857
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. graph combine "FIGURE1A.gph" "FIGURE1B.gph" "FIGURE1C.gph"
{res}{txt}
{com}. graph save "FIGURE1.gph", replace
{res}{txt}file {bf:FIGURE1.gph} saved

{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\May Baydoun_folder\UK_BIOBANK_PROJECT\UKB_PAPER8B_PERIONDONTALDISEASE_OLINK_DEM\DATA\finaldata_unimputedfin.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}